//* JCL to assemble and link the SMF modules in hlq.SMFPGMS.CBT.PDS.
//* hlq.SMFPGMS.CBT.PDS is this data set.
//* Add a JOB statement to this member, alter hlq.SMFPGMS.CBT.PDS
//* to your standards and run this job to create userid.SMFPGMS.LOAD.
//HLASM   PROC M='?'
//C       EXEC PGM=ASMA90,PARM='OBJECT,NODECK,XREF(SHORT)'
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DISP=(MOD,PASS),UNIT=SYSDA,SPACE=(CYL,(1,1,1)),
//             DSN=&&OBJ(&M)
//SYSLIB   DD  DISP=(SHR,PASS),DSN=SYS1.MODGEN
//         DD  DISP=(SHR,PASS),DSN=SYS1.MACLIB
//SYSIN    DD  DISP=(SHR,PASS),DSN=hlq.SMFPGMS.CBT.PDS(&M)
//        PEND
//PREP    EXEC PGM=IEFBR14
//SYSLMOD  DD  DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,0),
//             DSN=&SYSUID..SMFPGMS.LOAD
//COPYMAN EXEC HLASM,M=COPYMAN
//SMFCOPY EXEC HLASM,M=SMFCOPY
//SCAN118 EXEC HLASM,M=SCAN118
//DSREF   EXEC HLASM,M=DSREF
//SMFETIME EXEC HLASM,M=SMFETIME
//SMFSTAT EXEC HLASM,M=SMFSTAT
//MINIFMT EXEC HLASM,M=MINIFMT
//QSORTS  EXEC HLASM,M=QSORTS
//LINK1   EXEC PGM=IEWL,PARM='MAP,XREF,LIST'
//SYSPRINT DD  SYSOUT=*
//OBJ      DD  DISP=(OLD,PASS),DSN=&&OBJ
//SYSLMOD  DD  DISP=(NEW,CATLG),UNIT=SYSDA,SPACE=(CYL,(1,1,2)),
//             DSN=*.PREP.SYSLMOD
//SYSLIN   DD  *
       INCLUDE OBJ(COPYMAN,MINIFMT)
          NAME COPYMAN(R)
       INCLUDE OBJ(SMFCOPY,MINIFMT)
          NAME SMFCOPY(R)
       INCLUDE OBJ(SCAN118,SMFETIME,MINIFMT,QSORTS)
          NAME SCAN118(R)
       INCLUDE OBJ(DSREF,MINIFMT,QSORTS)
          NAME DSREF(R)
//LINK2   EXEC PGM=IEWL,PARM='MAP,XREF,LIST,RENT,REFR,REUS'
//SYSPRINT DD  SYSOUT=*
//OBJ      DD  DISP=(OLD,DELETE),DSN=&&OBJ
//SYSLMOD  DD  DISP=OLD,DSN=*.PREP.SYSLMOD
//SYSLIN   DD  *
       INCLUDE OBJ(SMFSTAT)
          NAME SMFSTAT(R)
/*
